# The fillna() function in pandas looks for the following values to replace in a DataFrame or Series:

# 1.) NaN (Not a Number): Represents missing or undefined numerical values.
# 2.) None: Represents missing or undefined non-numeric (object) values.
# 3.) NaT (Not a Time): Represents missing or undefined datetime values.

In [17]:
import pandas as pd
import numpy as np

# Sample data with different types of null values
data = {'Name': ['Alice', 'Bob', 'David', None],
        'Age': [25, 40, np.nan , 35],
        'Score': [85.5, 70.6, np.nan, 92.7 ],
        'Timestamp': ['2022-01-01', '2022-01-02', pd.NaT, '2022-01-04']}

df = pd.DataFrame(data)

In [18]:
df

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5  2022-01-01
1    Bob  40.0   70.6  2022-01-02
2  David   NaN    NaN         NaT
3   None  35.0   92.7  2022-01-04

In [19]:
df2 = df.fillna(0)

In [20]:
df2

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5  2022-01-01
1    Bob  40.0   70.6  2022-01-02
2  David   0.0    0.0           0
3      0  35.0   92.7  2022-01-04

In [21]:
# forward fill
df3 = df.ffill()

In [22]:
df3

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5  2022-01-01
1    Bob  40.0   70.6  2022-01-02
2  David  40.0   70.6  2022-01-02
3  David  35.0   92.7  2022-01-04

In [23]:
# Backward fill
df4 = df.bfill()

In [24]:
df4

    Name   Age  Score   Timestamp
0  Alice  25.0   85.5  2022-01-01
1    Bob  40.0   70.6  2022-01-02
2  David  35.0   92.7  2022-01-04
3   None  35.0   92.7  2022-01-04